system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  2.4.0                                  |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    (0     0     0)
    (1.0   0     0)
    (1.0   0.20  0)
    (0     0.20  0)
    (0     0     0.10)
    (1.0   0     0.10)
    (1.0   0.20  0.10)
    (0     0.20  0.10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type            patch;
        faces           ((0 4 7 3));
    }
    outlet
    {
        type            patch;
        faces           ((1 2 6 5));
    }
    bed
    {
        type            wall;
        faces           ((0 1 5 4));
    }
    top
    {
        type            patch;
        faces           ((3 7 6 2));
    }
    sideWalls
    {
        type            wall;
        faces           ((0 3 2 1) (4 5 6 7));
    }
);

mergePatchPairs
(
);

// ************************************************************************* //